app/controllers/articles_controller.rb

  def update
    @article = Article.update(title: params[:article][:title], description: params[:article][:description])
---
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-01-13 17:02:19.792306"], ["id", 1]]